

dict_hour = {1 : "один час", 2 : "два часа", 3 : "три часа", 4 : "четыре часа", 5 : "пять часов", 6 : "шесть часов", 7 : "семь часов", 8 : "восемь часов", 9 : "девять часов", 10 : "десять часов", 11 : "одиннадцать часов", 12 : "двенадцать часов", 13 : "один час", 14 : "два часа", 15 : "три часа", 16 : "четыре часа", 17 : "пять часов", 18 : "шесть часов", 19 : "семь часов", 20 : "восемь часов", 21 : "девять часов", 22 : "десять часов", 23 : "одиннадцать часов", 24 : "двенадцать часов"}
dict_min_less_thirty = {1 : "одна минута", 2 : "две минуты", 3 : "три минуты", 4 : "четыре минуты", 5 : "пять минут", 6 : "шесть минут", 7 : "семь минут", 8 : "восемь минут", 9 : "девять минут", 10 : "десять минут", 11 : "одиннадцать минут", 12 : "двенадцать минуты", 13 : "тринадцать минут", 14 : "четырнадцать минуты", 15 : "пятнадцать минут", 16 : "шестнадцать минут", 17 : "семнадцать минут", 18 : "восемнадцать минут", 19 : "девятнадцать минут", 20 : "двадцать минут", 21 : "двадцать одна минута", 22 : "двадцать две минуты", 23 : "двадцать три минуты", 24 : "двадцать четыре минуты", 25 : "двадцать пять минут", 26 : "двадцать шесть минут", 27 : "двадцать семь минут", 28 : "двадцать восемь минут", 29 : "двадцать девять минут"}
dict_hour_less_thirty = {1 : "первого", 2 : "вторго", 3 : "третьего", 4 : "четвертого", 5 : "пятого", 6 : "шестого", 7 : "седьмого", 8 : "восьмого", 9 : "девятого", 10 : "десятого", 11 : "одиннадцатого", 12 : "двенадцатого", 13 : "первого", 14 : "вторго", 15 : "третьего", 16 : "четвертого", 17 : "пятого", 18 : "шестого", 19 : "седьмого", 20 : "восьмого", 21 : "девятого", 22 : "десятого", 23 : "одиннадцатого", 24 : "двенадцатого"}
dict_hour_between_thirty_fortyfive = {31 : "тридцать одна минута", 32 : "тридцать две минуты", 33 : "тридцать три минуты", 34 : "тридцать четыре минуты", 35 : "тридцать пять минут", 36 : "тридцать шесть минут", 37 : "тридцать семь минут", 38 : "тридцать восемь минут", 39 : "тридцать девять минут", 40 : "сорок минут", 41 : "сорок одна минута", 42 : "сорок две минуты", 43 : "сорок три минуты", 44 : "сорок четыре минуты"}
dict_min_more_fortyfive = {45 : "пятнадцати", 46 : "четырнадцати", 47 : "тринадцати", 48 : "двенадцати", 49 : "одиннадцати", 50 : "десяти", 51 : "девяти", 52 : "восьми", 53 : "семи", 54 : "шести", 55 : "пяти", 56 : "четырех", 57 : "трёх", 58 : "двух", 59 : "одной"}
dict_hour_more_fortyfive = {1 : "час", 2 : "два", 3 : "три", 4 : "четыре", 5 : "пять", 6 : "шесть", 7 : "семь", 8 : "восемь", 9 : "девять", 10 : "десять", 11 : "одиннадцать", 12 : "двенадцать",13 : "час", 14 : "два", 15 : "три", 16 : "четыре", 17 : "пять", 18 : "шесть", 19 : "семь", 20 : "восемь", 21 : "девять", 22 : "десять", 23 : "одиннадцать", 24 : "двенадцать"}
cycle_value = True
while cycle_value:
    time = input("Введите, пожалуйста, время в формате чч:мм\n")
    time = time.replace(" ", "")
    time = time.split(":")

    while time[0].isdigit() and time[1].isdigit():
        if int(time[1]) == 00:
            print(f"{dict_hour[int(time[0])]} ровно")
            cycle_value = False
            break
        elif int(time[1]) < 30:
            print(f"{dict_min_less_thirty[(int(time[1]))]} {dict_hour_less_thirty[(int(time[0]) + 1)]}") 
            cycle_value = False
            break
        elif int(time[1]) == 30:
            print(f"половина {dict_hour_less_thirty[(int(time[0]) + 1)]}")
            cycle_value = False
            break
        elif int(time[1]) > 30 and int(time[1]) < 45:
            print(f"{dict_hour_between_thirty_fortyfive[int(time[1])]}{dict_hour_less_thirty[int(time[0])]}")
            cycle_value = False
            break
        elif int(time[1]) >= 45:
            print(f"без {dict_min_more_fortyfive[int(time[1])]} минут {dict_hour_more_fortyfive[(int(time[0]) + 1)]}")
            cycle_value = False
            break
    else:
        print("Ввели неверный формат.")
    
             
























































































    
