input_time = input("Введите время в формате hh:mm--> ").replace(' ', '').split(":")

hours = int(input_time[0])
minuts = int(input_time[1])


dict_time_hour = {0: "ноль", 1: ["один", "первого"], 2: ["два", "второго"], 3: ["три", "третьего"],
                  4: ["четыре", "четвертого"], 5: ["пять", "пятого"], 6: ["шесть", "шестого"],
                  7: ["семь", "седьмого"], 8:["восемь", "восьмого"], 9: ["девять", "девятого"],
                  10: ["десять", "десятого"], 11: ["одинадцать", "одинадцатого"], 12: ["двенадцать", "двенадцатого"],
                  13: ["тринадцать", "первого", "один"], 14: ["четырнадцать", "второго", "два"],
                  15: ["Пятнадцать", "третьего", "три"], 16: ["шестнадцать", "четвертого", "четыре"],
                  17: ["семнадцать", "пятого", "пять"], 18: ["восемнадцать", "шестого", "шесть"],
                  19: ["девятнадцать", "седьмого", "семь"], 20: ["двадцать", "восьмого", "восемь"],
                  21: ["двадцать один", "девятого", "девять"], 22: ["двадцать два", "десятого", "десять"],
                  23: ["двадцать три", "одинадцатого", "одинадцать"]}


dict_time_minuts = {0: "ровно", 1: ["одна", "одной"], 2: ["две", "двух"], 3: ["три", "трех"], 
                    4: ["четыре", "четырех"], 5: ["пять", "пяти"],  6: ["шесть", "шести"], 7: ["семь", "семи"], 
                    8: ["восемь", "восьми"], 9: ["девять" "девяти"], 10: ["десять", "десяти"], 
                    11: ["одинадцать", "одинадцати"], 12: ["двенадцать", "двенадцати"], 13: ["тринадцать", "тринадцати"],
                    14: ["четырнадцать", "четырнадцати"], 15: ["пятнадцать", "пятнадцати"],
                    16: "шестнадцать", 17: "семнадцать", 18: "восемьнадцать", 19: "девятнадцать", 
                    20: "двадцать", 21: "двадцать одна", 22: "двадцать две", 23: "двадцать три",
                    24: "Двадцать четыре", 25: "двадцать пять", 26: "двадцать шесть", 27: "двадцать семь",
                    28: "двадцать восемь", 29: "двадцать девять", 30: "половина", 31: "тридцать одна",
                    32: "тридцать две", 33: "тридцать три", 34: "тридцать четыре", 35: "тридцать пять",
                    36: "тридцать шесть", 37: "тридацть семь", 38: "тридцать восемь", 39: "тридцать девять", 40: "сорок",
                    41: "сорок одна", 42: "сорок два", 43: "сорок три", 44: "сорок четыре"}


if minuts == 0:
    print(f"{input_time[0]}:{input_time[1]} - {dict_time_hour[hours][2]} часа {dict_time_minuts[0]}")

elif minuts < 30:
    print(f"{input_time[0]}:{input_time[1]} - {dict_time_minuts[minuts]} минут {dict_time_hour[hours + 1][1]}")

elif minuts == 30:
    print(f"{input_time[0]}:{input_time[1]} - половина {dict_time_hour[hours + 1][1]}")

elif 30 < minuts < 45:
    print(f"{input_time[0]}:{input_time[1]} - {dict_time_minuts[minuts]} минут {dict_time_hour[hours + 1][1]}")

elif 45 <= minuts < 60:
    result_minuts = 60 - minuts
    print(f"{input_time[0]}:{input_time[1]} - без {dict_time_minuts[result_minuts][1]} минут {dict_time_hour[hours + 1][2]}")

else:
    raise KeyError('Вы ввели не верные данные попробуйте снова')